In [2]:
import pandas as pd
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

In [3]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [4]:
df = (
    # 2. .melt() lets you unpivot the table
    products.melt(
        # 3. Columns you want to leave unchanged
        id_vars = ['product_id'],
        # 4. Columns you want to unpivot
        value_vars = ['store1', 'store2', 'store3'], 
        # 5. This names the store column
        var_name = 'store',
        # 6. This names the price column
        value_name = 'price'
        )
    # 7. .dropna() lets you drop the null values
    .dropna() 
)

In [5]:
df

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80